app/controllers/business_owners_controller.rb

SELECT "business_owners".* FROM "business_owners"
---
  def index
    @business_owners = BusinessOwner.all

SELECT  "business_owners".* FROM "business_owners" WHERE "business_owners"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
---
    def set_business_owner
      @business_owner = BusinessOwner.find(params[:id])